a = int(input("Введіть скільки років ви працюєте:"))
b = int(input("Введіть вашу зп:"))
if a <= 0:
     print("Некоректні дані")
     quit()
elif a <= 3:
     print("Ваша зп збільшується на 10%")
     print(b *0.1 +b)
elif a > 3:
     print("Ваша зп збільшується на 20%")
     print(b * 0.2 + b)
if (b*0.1+b) < 4000:
     print("Вам додається бонус у розмірі 1000")
     print((b * 0.1 +b)+1000)
else:
     print("Вам додається бонус у розмірі 500")
     print((b * 0.2 + b)+500)




